app/views/messages/_message.html.erb

INSERT INTO "messages" ("user_id", "room_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["room_id", 101], ["content", "hi"], ["created_at", "2021-12-05 04:29:33.254394"], ["updated_at", "2021-12-05 04:29:33.254394"]]
---
  <%= message.content %>
  <p style="margin-top:5px; font-size:10px; margin-bottom:-5px;"> <%= message.created_at.localtime.strftime("%Y-%m-%d %I:%M%P") %> </p>