app/controllers/messages_controller.rb

INSERT INTO "messages" ("user_id", "room_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["room_id", 101], ["content", "hi"], ["created_at", "2021-12-05 04:29:33.254394"], ["updated_at", "2021-12-05 04:29:33.254394"]]
---
    def create
      @current_user = current_user
      @message = @current_user.messages.create(content: msg_params[:content], room_id: params[:room_id])