app/controllers/rooms_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = ?  [["room_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @current_user = current_user;@single_room = Room.find(params[:id]);public_rooms = Room.public_rooms;user_lat = current_user.lat;user_long = current_user.long;tmp_rooms = [];public_rooms.each  { |room| room_dist_req = room.distance;lat1 = room.lat;lon1 = room.long;tmp_rooms.append(room) if isInRadius(user_lat, user_long, lat1, lon1, room_dist_req) } ;@rooms = tmp_rooms;@users = User.all_except(@current_user);@room = Room.new;@message = Message.new;@messages = @single_room.messages;render "index"