app/controllers/rooms_controller.rb

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 122], ["LIMIT", 1]]
---
  def show

    index()
    @single_room = Room.find(params[:id]);