app/controllers/rooms_controller.rb

    @room = Room.new
    @user_names = User.all_except(@current_user).pluck(:name)
    @courses = Course.all
    @departments = Course.distinct.pluck(:department_code).prepend("ALL")

    @private_rooms = Room.joins("INNER JOIN participants ON rooms.id = participants.room_id AND participants.user_id = #{current_user.id}").uniq unless not current_user
---
SELECT DISTINCT "courses"."department_code" FROM "courses"
SELECT "rooms".* FROM "rooms" INNER JOIN participants ON rooms.id = participants.room_id AND participants.user_id = 1

  def create
    @current_user = current_user;
    if !@current_user
      redirect_to '/signin'
    end

    if current_user && current_user.lat && current_user.long
      room_lat = current_user.lat
      room_long = current_user.long
    else
      room_lat = 0;room_long = 0
    end

    if params["room"]["private_room"] == "No"
      @room = Room.create(distance: params["room"]["distance"], name: params["room"]["name"], is_private: false, lat: room_lat, long: room_long)
    else
      @room = Room.create(distance: params["room"]["distance"], name: params["room"]["name"], is_private: true, lat: room_lat, long: room_long)
      sel_users = params["room"][:selected_users]
      # puts sel_users
      if sel_users
        sel_users.each do |s_user|
            user = User.where(name: s_user)
            # puts "potato"
            Participant.create(user_id: user.first.id, room_id: @room.id)
        end
        Participant.create(user_id: current_user.id, room_id: @room.id) #Add Current User
      end
    end

    @private_rooms = Room.joins("INNER JOIN participants ON rooms.id = participants.room_id AND participants.user_id = #{current_user.id}").uniq unless not current_user
---
INSERT INTO "rooms" ("name", "is_private", "created_at", "updated_at", "lat", "long") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Umangplsxd"], ["is_private", 0], ["created_at", "2021-12-17 09:53:40.069845"], ["updated_at", "2021-12-17 09:53:40.069845"], ["lat", 40.805451], ["long", -73.964935]]
SELECT "users".* FROM "users" WHERE "users"."name" = ? ORDER BY "users"."id" ASC LIMIT ?  [["name", "Parth Sir"], ["LIMIT", 1]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."is_private" = ?  [["is_private", 0]]
INSERT INTO "participants" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["room_id", 122], ["created_at", "2021-12-05 06:21:35.441052"], ["updated_at", "2021-12-05 06:21:35.441052"]]
SELECT "rooms".* FROM "rooms" INNER JOIN participants ON rooms.id = participants.room_id AND participants.user_id = 1

    @user_names = User.all_except(@current_user).pluck(:name)
    @rooms = Room.public_rooms
    @courses = Course.all
    @departments = Course.distinct.pluck(:department_code).prepend("ALL")
---
SELECT DISTINCT "courses"."department_code" FROM "courses"

  def show
    @current_user = current_user;
    @single_room = Room.find(params[:id]);
    public_rooms = Room.public_rooms;
    @private_rooms = Room.joins("INNER JOIN participants ON rooms.id = participants.room_id AND participants.user_id = #{current_user.id}").uniq unless not current_user;
    user_lat = current_user.lat;
    user_long = current_user.long;
    tmp_rooms = [];
    public_rooms.each do |room|
      room_dist_req = room.distance;
      lat1 = room.lat;
      lon1 = room.long;
      if (isInRadius(user_lat, user_long, lat1, lon1, room_dist_req) && room.distance != Float::MAX) || (params["dept_id"].nil? && room.dept_code != "NONE") || (!params["dept_id"].nil? && params["dept_id"] != "ALL" && room.dept_code == params["dept_id"])
        tmp_rooms.append(room)
      end
      if params["dept_id"] == "ALL" && room.dept_code != "NONE"
        tmp_rooms.append(room)
      end
    end
    @rooms = tmp_rooms;
    @users = User.all_except(@current_user);
    @user_names = User.all_except(@current_user).pluck(:name);
    @room = Room.new;
    @message = Message.new;
    @messages = @single_room.messages;

    @courses = Course.all
    @departments = Course.distinct.pluck(:department_code).prepend("ALL")
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "rooms".* FROM "rooms" INNER JOIN participants ON rooms.id = participants.room_id AND participants.user_id = 1
SELECT DISTINCT "courses"."department_code" FROM "courses"