app/controllers/sessions_controller.rb

    def create
      puts "redriected??"
      user = User.find_by(username: params[:session][:username])
      password = params[:session][:password]
      if user
        if cookies[:lat_lng]
          lat_lng = cookies[:lat_lng].split("|")
          lat_gps = lat_lng[0]
          long_gps = lat_lng[1]
        else
          lat_gps = 0
          long_gps = 0
        end
        if user
          user.update(lat: lat_gps, long: long_gps)
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Umang"], ["LIMIT", 1]]
UPDATE "users" SET "lat" = ?, "long" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["lat", 40.80295237645102], ["long", -73.96453569457155], ["updated_at", "2021-12-05 04:28:24.957993"], ["id", 1]]