app/controllers/users_controller.rb

    def show
      @user = User.find(params[:id])
      @current_user = current_user
      return redirect_to '/signin' unless @current_user
      user_lat = current_user.lat
      user_long = current_user.long
      public_rooms = Room.public_rooms
      tmp_rooms = []
      public_rooms.each do |room|
        room_dist_req = room.distance
        lat1 = room.lat
        lon1 = room.long
        if (isInRadius(user_lat, user_long, lat1, lon1, room_dist_req) && room.distance != Float::MAX) || (params["dept_id"].nil? && room.dept_code != "NONE") || (params["dept_id"] == "ALL" && room.dept_code != "NONE") || (!params["dept_id"].nil? && params["dept_id"] != "ALL" && room.dept_code == params["dept_id"])
          tmp_rooms.append(room)
        end
      end
      @rooms = tmp_rooms
      @users = User.all_except(@current_user)
      @user_names = User.all_except(@current_user).pluck(:name)
      @room = Room.new
      @message = Message.new
      @room_name = get_name(@user, @current_user)
      @single_room = Room.where(name: @room_name).first || Room.create_private_room([@user, @current_user], @room_name)
      @messages = @single_room.messages
      @departments = Course.distinct.pluck(:department_code).prepend("ALL")
      @private_rooms = Room.joins("INNER JOIN participants ON rooms.id = participants.room_id AND participants.user_id = #{current_user.id}").uniq unless not current_user
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "rooms" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "private_1_4"], ["created_at", "2021-11-03 04:45:47.909764"], ["updated_at", "2021-11-03 04:45:47.909764"]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."name" = ? ORDER BY "rooms"."id" ASC LIMIT ?  [["name", "private_1_2"], ["LIMIT", 1]]
SELECT DISTINCT "courses"."department_code" FROM "courses"
SELECT "rooms".* FROM "rooms" INNER JOIN participants ON rooms.id = participants.room_id AND participants.user_id = 1

    def create
      @user = User.new(user_params)
      if @user.validate
        @user.save
---
INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at", "confirm_token", "name") VALUES (?, ?, ?, ?, ?, ?, ?)

    def confirm_email
      user = User.find_by_confirm_token(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."confirm_token" = ? LIMIT ?  [["confirm_token", "M-GoFHD82FOcIFsv_coZ0A"], ["LIMIT", 1]]